Tekla.Structures.CatalogInternal.RebarOperations
Rebar operations

Tekla.Structures.CatalogInternal.RebarOperations.RebarDataBaseFileName
Rebar data base file name.

Tekla.Structures.CatalogInternal.RebarOperations.rebarItemLines
RebarItem lines list.

Tekla.Structures.CatalogInternal.RebarOperations.rebarDbFilePath
Rebar database file path

Tekla.Structures.CatalogInternal.RebarOperations.#ctor
Initializes a new instance of the Tekla.Structures.CatalogInternal.RebarOperations class

Tekla.Structures.CatalogInternal.RebarOperations.DeleteRebarItem(Tekla.Structures.Catalogs.RebarItem)
Delete the passed rebar item in the database.
rebarItem: rebarItem to delete
Returns: True on success

Tekla.Structures.CatalogInternal.RebarOperations.InsertRebarItem(Tekla.Structures.Catalogs.RebarItem)
Insert the passed rebar item in the database.
rebarItem: rebarItem to insert
Returns: True on success

Tekla.Structures.CatalogInternal.RebarOperations.ModifyRebarItem(Tekla.Structures.Catalogs.RebarItem,Tekla.Structures.Catalogs.RebarItem)
Modifies the rebar item in the rebar database based on the given original rebar item.
rebarItem: rebar Item
originalRebarItem: original Rebar Item
Returns: True on success

Tekla.Structures.CatalogInternal.RebarOperations.ReadRebarItemsFromFile(System.String)
Returns rebar items from the file.
filePath: File path of rebar database.
Returns: The list of rebar items.

Tekla.Structures.CatalogInternal.RebarOperations.IsValidRebarItem(Tekla.Structures.Catalogs.RebarItem)
Validate the Rebaritem.
rebarItem: rebar item
Returns: True on success

Tekla.Structures.CatalogInternal.RebarOperations.GetParametersWithActualSpacing(System.String)
Process the currentFormat string and returns the parameter list with actual spacings
currentFormat: current Format string
Returns: List of parameters with actual spacings

Tekla.Structures.CatalogInternal.RebarOperations.GetParametersInOrderFromRebarItem(Tekla.Structures.Catalogs.RebarItem)
Get the list of parameters from the RebarItem object
rebarItem: rebar item
Returns: RebarItem parameters

Tekla.Structures.CatalogInternal.RebarOperations.GetFormattedStringOfRebarItem(Tekla.Structures.Catalogs.RebarItem,System.String)
Get the formatted string based on the passed format.
rebarItem: rebar item
currentFormat: current format
Returns: Formatted string.

Tekla.Structures.CatalogInternal.RebarOperations.GetFormattedStringOfRebarItem(Tekla.Structures.Catalogs.RebarItem)
Get the formatted string
rebarItem: The rebar item.
Returns: Formatted string.

Tekla.Structures.CatalogInternal.RebarOperations.CopyRebarDataBaseToModelFolder
Copy rebar_database.inp file to Model folder if not exists.

Tekla.Structures.CatalogInternal.RebarOperations.GetRebarItemMatchIndex(Tekla.Structures.Catalogs.RebarItem)
Return the line index if rebar item match
rebarItem: rebarItem from the rebar db file
Returns: line index from the file

Tekla.Structures.CatalogInternal.RebarOperations.GetIndexOfLastValidRebarItem
Get the Index of last valid record
Returns: index